src/cf/Documents/уатОперацияСВагонами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>уатОперацияСВагонами</Name>
			<BasedOn>
				<xr:Item>Document.уатНатурныйЛист</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.уатОборотыВагоновПоСтанции</xr:Item>
				<xr:Item>AccumulationRegister.уатЗаказыГрузоотправителей</xr:Item>
				<xr:Item>InformationRegister.уатСостояниеТС</xr:Item>
				<xr:Item>AccumulationRegister.уатОборотыВагоновПоСтанцииОстатки</xr:Item>
				<xr:Item>AccumulationRegister.уатГрузыКПеревозке_уэ</xr:Item>
				<xr:Item>InformationRegister.уатСтатусыГрузов_уэ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Местоположение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатВидыОперацийСВагоном</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НатурныйЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатНатурныйЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Вагоны</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаОперации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вагон</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказНаТС</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/уатОбеспечениеЗаказовНаТСВагонами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатОбеспечениеЗаказовНаТСВагонами</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоУпаковок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаказНаТС</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерГУ12</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Груз</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатГрузовыеМеста_уэ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодГруза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатКодыЕТСНГ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вагон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/уатЗаказыГрузоотправителей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>уатЗаказыГрузоотправителей</Name>
			<Comment>(уат)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество, всегда 1</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказГрузоотправителя</Name>
					<Comment>Только родительский грузы (не этапы)</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГрузовоеМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатГрузовыеМеста_уэ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>Единица измерения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатВидыУпаковки_уэ</v8:Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.уатТипыКонтейнеров_уэ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/уатГрузыКПеревозке_уэ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>уатГрузыКПеревозке_уэ</Name>
			<Comment>(уат)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказГрузоотправителя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГрузовоеМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатГрузовыеМеста_уэ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатВидыУпаковки_уэ</v8:Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.уатТипыКонтейнеров_уэ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/Enums/уатДетализацияЗаказаГрузоотправителя_уэ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатДетализацияЗаказаГрузоотправителя_уэ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоЗаказам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоГрузовымМестам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоТоварам</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/уатОперацияСВагонами/Ext/ManagerModule.bsl
#Область СлужебныйПрограммныйИнтерфейс

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	СформироватьТаблицаСостояниеТС(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицаСтатусыГрузов(ДокументСсылка, СтруктураДополнительныеСвойства);
	ЗаполнитьДанныеТаблицЗакрытия(ДокументСсылка, СтруктураДополнительныеСвойства);
	Если ДокументСсылка.Операция.ЭтоПрибытие Или ДокументСсылка.Операция.ЭтоУбытие Тогда
		СформироватьТаблицаОборотВагоновПоСтанцииОстатки(ДокументСсылка, СтруктураДополнительныеСвойства);
		СформироватьТаблицаОборотВагоновПоСтанции(ДокументСсылка, СтруктураДополнительныеСвойства);
	КонецЕсли;
КонецПроцедуры

Процедура ВыполнитьКонтроль(ДокументСсылка, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаСостояниеТС(ДокументСсылка, СтруктураДополнительныеСвойства)
	мЗапрос = Новый Запрос;
	мЗапрос.Текст =
	"ВЫБРАТЬ
	|	уатОперацияСВагонамиВагоны.Вагон КАК ТС,
	|	уатОперацияСВагонами.Местоположение КАК Местоположение,
	|	уатОперацияСВагонами.Операция.СостояниеТС КАК Состояние,
	|	МИНИМУМ(уатОперацияСВагонамиВагоны.ДатаОперации) КАК Период,
	|	уатОперацияСВагонамиВагоны.ЗаказНаТС КАК Заказ,
	|	уатОперацияСВагонамиВагоны.ЗаказНаТС.Контрагент КАК Контрагент
	|ИЗ
	|	Документ.уатОперацияСВагонами КАК уатОперацияСВагонами
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уатОперацияСВагонами.Вагоны КАК уатОперацияСВагонамиВагоны
	|		ПО уатОперацияСВагонами.Ссылка = уатОперацияСВагонамиВагоны.Ссылка
	|ГДЕ
	|	уатОперацияСВагонами.Ссылка = &ДокументСсылка
	|
	|СГРУППИРОВАТЬ ПО
	|	уатОперацияСВагонамиВагоны.ЗаказНаТС,
	|	уатОперацияСВагонамиВагоны.Вагон,
	|	уатОперацияСВагонами.Местоположение,
	|	уатОперацияСВагонами.Операция.СостояниеТС,
	|	уатОперацияСВагонамиВагоны.ЗаказНаТС.Контрагент";
	мЗапрос.УстановитьПараметр("ДокументСсылка",ДокументСсылка);
	
	ТаблицаДокумента = мЗапрос.Выполнить().Выгрузить();

	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСостоянийТС", ТаблицаДокумента);
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаСтатусыГрузов(ДокументСсылка, СтруктураДополнительныеСвойства)
	мЗапрос = Новый Запрос;
	мЗапрос.Текст = 
	"ВЫБРАТЬ
	|	уатОперацияСВагонамиВагоны.ЗаказНаТС КАК Заказ,
	|	уатОперацияСВагонамиВагоны.Ссылка.Операция.СтатусГруза КАК Статус,
	|	уатОперацияСВагонамиВагоны.ДатаОперации КАК Период,
	|	уатОперацияСВагонамиВагоны.Ссылка КАК Регистратор,
	|	уатОперацияСВагонамиВагоны.Вагон КАК Вагон
	|ПОМЕСТИТЬ ВТ_ОперацияСВагонами
	|ИЗ
	|	Документ.уатОперацияСВагонами.Вагоны КАК уатОперацияСВагонамиВагоны
	|ГДЕ
	|	уатОперацияСВагонамиВагоны.ЗаказНаТС <> ЗНАЧЕНИЕ(Документ.уатЗаказгрузоотправителя.ПустаяСсылка)
	|	И уатОперацияСВагонамиВагоны.Ссылка.Операция.СтатусГруза <> ЗНАЧЕНИЕ(Справочник.уатСтатусы_уэ.ПустаяСсылка)
	|	И уатОперацияСВагонамиВагоны.ЗаказНаТС.Проведен
	|	И уатОперацияСВагонамиВагоны.Ссылка = &ДокументСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(уатОбеспечениеЗаказовНаТСВагонами.Груз, ЗНАЧЕНИЕ(Справочник.уатГрузовыеМеста_уэ.ПустаяСсылка)) КАК ГрузовоеМесто,
	|	ВТ_ОперацияСВагонами.Заказ КАК Заказ,
	|	ВТ_ОперацияСВагонами.Статус КАК Статус,
	|	ВТ_ОперацияСВагонами.Период КАК Период,
	|	ВТ_ОперацияСВагонами.Регистратор КАК Регистратор
	|ИЗ
	|	ВТ_ОперацияСВагонами КАК ВТ_ОперацияСВагонами
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уатОбеспечениеЗаказовНаТСВагонами КАК уатОбеспечениеЗаказовНаТСВагонами
	|		ПО ВТ_ОперацияСВагонами.Заказ = уатОбеспечениеЗаказовНаТСВагонами.ЗаказНаТС
	|			И ВТ_ОперацияСВагонами.Вагон = уатОбеспечениеЗаказовНаТСВагонами.Вагон";
	мЗапрос.УстановитьПараметр("ДокументСсылка",ДокументСсылка);
	
	ТаблицаДокумента = мЗапрос.Выполнить().Выгрузить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСтатусыГрузов", ТаблицаДокумента);
КонецПроцедуры

Процедура ЗаполнитьДанныеТаблицЗакрытия(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	мЗапрос = Новый Запрос();
	
	мЗапрос.УстановитьПараметр("МоментВремени",  ДокументСсылка.МоментВремени());
	мЗапрос.УстановитьПараметр("ДокументСсылка",         ДокументСсылка);
	мЗапрос.УстановитьПараметр("ПериодДвижения", СтруктураДополнительныеСвойства.ДляПроведения.Дата);
	
	мЗапрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатОперацияСВагонамиВагоны.ЗаказНаТС КАК ЗаказГрузоотправителя,
	|	ЗНАЧЕНИЕ(Справочник.уатСтатусы_уэ.Закрыт) КАК Статус,
	|	уатОперацияСВагонамиВагоны.ДатаОперации КАК Период
	|ПОМЕСТИТЬ ВРТ_Документ
	|ИЗ
	|	Документ.уатОперацияСВагонами КАК уатОперацияСВагонами
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уатОперацияСВагонами.Вагоны КАК уатОперацияСВагонамиВагоны
	|		ПО уатОперацияСВагонами.Ссылка = уатОперацияСВагонамиВагоны.Ссылка
	|ГДЕ
	|	уатОперацияСВагонамиВагоны.Ссылка = &ДокументСсылка
	|	И уатОперацияСВагонами.Операция.ЗаказНаТСВыполнен
	|
	|СГРУППИРОВАТЬ ПО
	|	уатОперацияСВагонамиВагоны.ЗаказНаТС,
	|	уатОперацияСВагонамиВагоны.ДатаОперации
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЗаказГрузоотправителя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатЗаказыГрузоотправителейОстатки.Контрагент КАК Контрагент,
	|	уатЗаказыГрузоотправителейОстатки.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	уатЗаказыГрузоотправителейОстатки.ЗаказГрузоотправителя КАК ЗаказГрузоотправителя,
	|	уатЗаказыГрузоотправителейОстатки.ГрузовоеМесто КАК ГрузовоеМесто,
	|	уатЗаказыГрузоотправителейОстатки.Номенклатура КАК Номенклатура,
	|	уатЗаказыГрузоотправителейОстатки.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	уатЗаказыГрузоотправителейОстатки.КоличествоОстаток КАК Количество,
	|	&ДокументСсылка КАК Регистратор,
	|	ВРТ_Документ.Период КАК Период
	|ПОМЕСТИТЬ ВРТ_ЗаказыГрузоотправителей
	|ИЗ
	|	РегистрНакопления.уатЗаказыГрузоотправителей.Остатки(
	|			&МоментВремени,
	|			ЗаказГрузоотправителя В
	|				(ВЫБРАТЬ
	|					Документ.ЗаказГрузоотправителя
	|				ИЗ
	|					ВРТ_Документ КАК Документ)) КАК уатЗаказыГрузоотправителейОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВРТ_Документ КАК ВРТ_Документ
	|		ПО уатЗаказыГрузоотправителейОстатки.ЗаказГрузоотправителя = ВРТ_Документ.ЗаказГрузоотправителя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВРТ_ЗаказыГрузоотправителей.Контрагент КАК Контрагент,
	|	ВРТ_ЗаказыГрузоотправителей.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВРТ_ЗаказыГрузоотправителей.ЗаказГрузоотправителя КАК ЗаказГрузоотправителя,
	|	ВРТ_ЗаказыГрузоотправителей.ГрузовоеМесто КАК ГрузовоеМесто,
	|	ВРТ_ЗаказыГрузоотправителей.Номенклатура КАК Номенклатура,
	|	ВРТ_ЗаказыГрузоотправителей.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВРТ_ЗаказыГрузоотправителей.Количество КАК Количество,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ВРТ_ЗаказыГрузоотправителей.Регистратор КАК Регистратор,
	|	ВРТ_ЗаказыГрузоотправителей.Период КАК Период
	|ИЗ
	|	ВРТ_ЗаказыГрузоотправителей КАК ВРТ_ЗаказыГрузоотправителей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатГрузыКПеревозке_уэОстатки.Контрагент КАК Контрагент,
	|	уатГрузыКПеревозке_уэОстатки.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	уатГрузыКПеревозке_уэОстатки.ЗаказГрузоотправителя КАК ЗаказГрузоотправителя,
	|	уатГрузыКПеревозке_уэОстатки.ГрузовоеМесто КАК ГрузовоеМесто,
	|	уатГрузыКПеревозке_уэОстатки.Номенклатура КАК Номенклатура,
	|	уатГрузыКПеревозке_уэОстатки.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	уатГрузыКПеревозке_уэОстатки.КоличествоОстаток КАК Количество,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&ДокументСсылка КАК Регистратор,
	|	ВРТ_Документ.Период КАК Период
	|ИЗ
	|	РегистрНакопления.уатГрузыКПеревозке_уэ.Остатки(
	|			&МоментВремени,
	|			ЗаказГрузоотправителя В
	|				(ВЫБРАТЬ
	|					Документ.ЗаказГрузоотправителя
	|				ИЗ
	|					ВРТ_Документ КАК Документ)) КАК уатГрузыКПеревозке_уэОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВРТ_Документ КАК ВРТ_Документ
	|		ПО уатГрузыКПеревозке_уэОстатки.ЗаказГрузоотправителя = ВРТ_Документ.ЗаказГрузоотправителя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВРТ_Документ.ЗаказГрузоотправителя КАК Заказ,
	|	ЕСТЬNULL(уатЗаказГрузоотправителяГрузовойСостав.ГрузовоеМесто, ЗНАЧЕНИЕ(Справочник.уатГрузовыеМеста_уэ.ПустаяСсылка)) КАК ГрузовоеМесто,
	|	МАКСИМУМ(ВРТ_Документ.Статус) КАК Статус,
	|	МАКСИМУМ(&ДокументСсылка) КАК Регистратор,
	|	МАКСИМУМ(&ПериодДвижения) КАК Период
	|ИЗ
	|	ВРТ_Документ КАК ВРТ_Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уатЗаказГрузоотправителя.ГрузовойСостав КАК уатЗаказГрузоотправителяГрузовойСостав
	|		ПО ВРТ_Документ.ЗаказГрузоотправителя = уатЗаказГрузоотправителяГрузовойСостав.Ссылка
	|			И (ВРТ_Документ.ЗаказГрузоотправителя.ДетализацияЗакрытия = ЗНАЧЕНИЕ(Перечисление.уатДетализацияЗаказаГрузоотправителя_уэ.ПоГрузовымМестам))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВРТ_Документ.ЗаказГрузоотправителя,
	|	ЕСТЬNULL(уатЗаказГрузоотправителяГрузовойСостав.ГрузовоеМесто, ЗНАЧЕНИЕ(Справочник.уатГрузовыеМеста_уэ.ПустаяСсылка))";
	
	мПакетРезультатов = мЗапрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗаказовГрузоотправителя", мПакетРезультатов[2].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаГрузовКПеревозке",        мПакетРезультатов[3].Выгрузить());
	//СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСтатусыГрузов",           мПакетРезультатов[4].Выгрузить());
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаОборотВагоновПоСтанцииОстатки(ДокументСсылка, СтруктураДополнительныеСвойства)
	мЗапрос = Новый Запрос;
	мЗапрос.Текст =
	"ВЫБРАТЬ
	|	уатОперацияСВагонамиВагоны.Вагон КАК Вагон,
	|	уатОперацияСВагонами.Местоположение КАК Станция,
	|	ВЫБОР
	|		КОГДА уатОперацияСВагонами.Операция.ЭтоПрибытие
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоПрибытие,
	|	1 КАК Количество,
	|	уатОперацияСВагонамиВагоны.ДатаОперации КАК Период
	|ИЗ
	|	Документ.уатОперацияСВагонами КАК уатОперацияСВагонами
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уатОперацияСВагонами.Вагоны КАК уатОперацияСВагонамиВагоны
	|		ПО уатОперацияСВагонами.Ссылка = уатОперацияСВагонамиВагоны.Ссылка
	|ГДЕ
	|	уатОперацияСВагонами.Ссылка = &ДокументСсылка
	|	И (уатОперацияСВагонами.Операция.ЭтоУбытие
	|			ИЛИ уатОперацияСВагонами.Операция.ЭтоПрибытие)";

	мЗапрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	
	ТаблицаДокумента = мЗапрос.Выполнить().Выгрузить();
	ТаблицаДокумента.Колонки.Добавить("ВидДвижения");
	
	Для каждого ТекСтрока Из ТаблицаДокумента Цикл
		Если ТекСтрока.ЭтоПрибытие Тогда
			ТекСтрока.ВидДвижения = ВидДвиженияНакопления.Приход;
		Иначе
			ТекСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
		КонецЕсли;
	КонецЦикла;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОборотыВагоновПоСтанцииОстатки", ТаблицаДокумента);
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаОборотВагоновПоСтанции(ДокументСсылка, СтруктураДополнительныеСвойства)
	мЗапрос = Новый Запрос;
	мЗапрос.Текст =
	"ВЫБРАТЬ
	|	уатОперацияСВагонамиВагоны.Вагон КАК Вагон,
	|	уатОперацияСВагонами.Местоположение КАК Станция,
	|	ВЫБОР
	|		КОГДА уатОперацияСВагонами.Операция.ЭтоПрибытие
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Прибыло,
	|	ВЫБОР
	|		КОГДА уатОперацияСВагонами.Операция.ЭтоУбытие
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Убыло,
	|	уатОперацияСВагонамиВагоны.ДатаОперации КАК Период
	|ИЗ
	|	Документ.уатОперацияСВагонами КАК уатОперацияСВагонами
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уатОперацияСВагонами.Вагоны КАК уатОперацияСВагонамиВагоны
	|		ПО уатОперацияСВагонами.Ссылка = уатОперацияСВагонамиВагоны.Ссылка
	|ГДЕ
	|	уатОперацияСВагонами.Ссылка = &ДокументСсылка
	|	И (уатОперацияСВагонами.Операция.ЭтоУбытие
	|			ИЛИ уатОперацияСВагонами.Операция.ЭтоПрибытие)";
	
	мЗапрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	
	ТаблицаДокумента = мЗапрос.Выполнить().Выгрузить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОборотыВагоновПоСтанции", ТаблицаДокумента);
КонецПроцедуры

#КонецОбласти

#КонецОбласти
